# Parameters
nc: 3  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors: 1  # number of anchors
loss: ComputeXLoss

# YOLOv5 backbone
backbone:
  # [from, number, module, args]               w*h,in,out
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2          320,3,32
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4       160,32,64
   [-1, 3, C3, [128]],          #                  64,64
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8       80, 64,128
   [-1, 9, C3, [256]],          #                  128,128
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16      40, 128,256
   [-1, 9, C3, [512]],          #                  256,256
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32     20, 256,512
   [-1, 3, C3, [1024, False]],  # 9
   [-1, 1, CoordAtt, [1024]],       #     add by ltz
   [-1, 1, SPP, [1024, [5, 9, 13]]],
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],    #                512,256
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   #  40, ,
   [[-1, 6], 1, Concat, [256,256]],  # cat backbone P4  40
   [-1, 3, C3, [512, False]],  # 13      14                   256,256

   [-1, 1, Conv, [256, 1, 1]],               #          256,128
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #     80,256,128
   [[-1, 4], 1, Concat, [128,128]],  # cat backbone P3
   [-1, 4, C3, [256, False]],  # 17 (P3/8-small)  18

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 6, 14], 1, Concat, [256,256]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)   21

   [-1, 1, Conv, [1024, 3, 2]],
   [[-1, 8], 1, Concat, [512,512]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)   24

# yolox head
   [18, 1, Conv, [256, 1, 1]],  # 24 lateral0 (P3/8-small)
   [21, 1, Conv, [256, 1, 1]],  # 25 lateral1 (P4/16-medium)
   [24, 1, Conv, [256, 1, 1]],  # 26 lateral2 (P5/32-large)

   [25, 2, Conv, [256, 3, 1]],  # 27 cls0 (P3/8-small)
   [25, 2, Conv, [256, 3, 1]],  # 28 reg0 (P3/8-small)

   [26, 2, Conv, [256, 3, 1]],  # 29 cls1 (P4/16-medium)
   [26, 2, Conv, [256, 3, 1]],  # 30 reg1 (P4/16-medium)

   [27, 2, Conv, [256, 3, 1]],  # 31 cls2 (P5/32-large)
   [27, 2, Conv, [256, 3, 1]],  # 32 reg2 (P5/32-large)

    [[28, 29, 30, 31, 32, 33], 1, DetectX, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
